# Generated with ChatGPT

from .base import MessageSchedule as MS

__ignore__ = True

GOOD_DAY_NIGHT = [
    MS(
        (
            "大佬们早上好",
            "各位早上好啊",
            "早上好 冲起来",
            "早上好呀，lsp们！",
            "起床尿尿了，打开emby来一发"
        ),
        ("7:20", "8:30"),
    ),
    MS(("出来吧 皮卡丘，给我一个口球吧", "有没有龙王给大家表演一个喷水啊", "冲完这一发就去睡觉"), ("11:30", "12:35"), possibility=0.7),
    MS(("下班了，吃饭了", "下班 又可以学习新的知识（zishi）了", "下班 溜了溜了", "下班!摸鱼的一天结束了"), ("18:00", "18:05"), only="weekdays"),
    MS(("冲不动了，晚安了各位", "晚安了，小怪兽给我一个口球吧", "大佬们别冲了，早点睡觉吧", "睡觉了，冲不动了，睡觉了", "各位大佬早点休息呀", "晚安，各位大佬"), ("22:30", "23:59")),
]


def WATERY(n, *args, **kw):
    return [
        MS(
            (
                "手动签",
                "水一分",
                "水一哈",
                "签到",
                "打卡",
                "水一水，提提神",
                "想低调当个大水逼",
                "水来",
                "好人一生平安！",
                "水 爽翻",
                "天天签到赚积分",
                "来这里水一水，拿点积分走人啦！",
                "玛卡巴卡巴卡",
                "听说这里有积分奖励",
                "好无聊啊最近",
                "好累啊，想放假",
                "有啥好玩的吗",
                "最近有什么好看的电影吗",
                "水水水",
                "我觉得这里针不戳",
                "来水一发",
                "今天的水量还不够",
                "水一水解乏",
                "我要水爆这里",
                "水个存在感",
                "偷偷来水一下",
                "来水一波，积分到手",
                "水不停，潮流不断",
                "水一发，走天下",
                "水不怕多，只怕少",
                "水个不停，拿积分不手软",
                "热爱水的人总有积分",
                "大水不流空，积分不来无",
                "水不只是水，更是一种态度",
                "水到临时才知道自己有多水",
                "水是一种技术活",
                "别闲着，快来水",
                "无聊就来水一下",
                "水的多，想的少",
                "水是心灵的抚慰 水是积分的保障 水是无边的欢乐",
                "水之所在，积分自来",
                "水之不竭，积分之源",
                "水到渠成，积分源源不断",
                "天天水，不用愁",
                "水不止五分钟，积分不止一点",
                "水不用解释，水就是水",
                "我水，故我在",
                "生命在于水，积分在于水",
                "水，让生命更加美好",
                "今天又水一水~",
            ),
            *args,
            **kw
        )
    ] * n
